## Лекция №01. Введение в Pandas

#### Теорема "No free launch"
##### Не бывает алгоритма, который одинаково хорошо работал бы на всех данных. 
##### Для разных типов данных оптимальны разные алгоритмы

Из этого следует, что на своих данных сначала надо попробовать простые алгоритмы.
Потом градиентный бустинг.
И только потом, при необходимости, запускайте нейронные сети

###### Наблюдение: В реальных проектах до 90% времени уходит на обработку данных. И только 10% - на машинное обучение

Pandas - по сути надстройка на NumPy (numerical python)

### Плюшки Jupiter'a:

Формулы из LaTeX  
$\Large\sqrt{a^2 + b^2}$

<img src = '../img/pic1.jpg'>

### Алгоритм первичного исследования данных
#### 1. Импортируем основные библиотеки
#### 2. Считываем данные
#### 3. df.head()
#### 4. df.shape
#### 5. df.info()
#### 6. df.describe()

In [1]:
import pandas as pd
import numpy as np


df = pd.read_csv('../data/beauty.csv', sep = ';')
df.head()

    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
1   4.28     28      0         1      0       1        1        0    12      3
2   7.96     35      0         1      0       1        0        0    10      4
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3

In [2]:
df.tail()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
1255,1.61,25,0,1,1,1,0,1,12,3
1256,1.68,4,0,1,0,1,1,1,12,2
1257,3.29,35,0,1,1,1,0,1,12,3
1258,2.31,15,0,1,1,1,1,1,10,3
1259,1.92,24,0,0,0,1,0,1,16,3

In [3]:
df.take([1, 11, 111, 1111])

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
1,4.28,28,0,1,0,1,1,0,12,3
11,4.03,6,0,1,0,0,1,0,16,4
111,5.54,7,0,1,0,1,0,1,17,4
1111,7.28,16,0,1,0,0,1,0,12,3

In [4]:
df.shape

(1260, 10)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1260 entries, 0 to 1259
Data columns (total 10 columns):
wage        1260 non-null float64
exper       1260 non-null int64
union       1260 non-null int64
goodhlth    1260 non-null int64
black       1260 non-null int64
female      1260 non-null int64
married     1260 non-null int64
service     1260 non-null int64
educ        1260 non-null int64
looks       1260 non-null int64
dtypes: float64(1), int64(9)
memory usage: 98.5 KB

In [6]:
df.describe()

,wage,exper,union,goodhlth,black,female,married,service,educ,looks
count,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000,1260.000000
mean,6.306690,18.206349,0.272222,0.933333,0.073810,0.346032,0.691270,0.273810,12.563492,3.185714
std,4.660639,11.963485,0.445280,0.249543,0.261564,0.475892,0.462153,0.446089,2.624489,0.684877
min,1.020000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,5.000000,1.000000
25%,3.707500,8.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,12.000000,3.000000
50%,5.300000,15.000000,0.000000,1.000000,0.000000,0.000000,1.000000,0.000000,12.000000,3.000000
75%,7.695000,27.000000,1.000000,1.000000,0.000000,1.000000,1.000000,1.000000,13.000000,4.000000
max,77.720000,48.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,17.000000,5.000000

#### Смотрим содержимое отдельного столбца

In [7]:
df['wage'].head()

0     5.73
1     4.28
2     7.96
3    11.57
4    11.42
Name: wage, dtype: float64

### loc и iloc
#### loc - работаем с названиями признаков и индексами
#### iloc - работаем с номерами признаков и индексами

In [8]:
df.loc[:,['wage', 'educ']].head()

    wage  educ
0   5.73    14
1   4.28    12
2   7.96    10
3  11.57    16
4  11.42    16

In [9]:
df.iloc[:,[0, 8]].tail()

      wage  educ
1255  1.61    12
1256  1.68    12
1257  3.29    12
1258  2.31    10
1259  1.92    16

###                                   Булевые маски

Например, мы хотим сравнить средний доход мужчин и женщин из нашей выборки

Алгоритм: как узнать среднюю зарплату женщин

In [10]:
# 1. Выцепим из нашего датафреймы женщин
df['female']==1

0        True
1        True
2        True
3       False
4       False
5        True
6       False
7       False
8        True
9        True
10       True
11      False
12      False
13      False
14      False
15      False
16      False
17      False
18       True
19       True
20      False
21      False
22      False
23      False
24      False
25      False
26      False
27      False
28      False
29      False
        ...
1230    False
1231    False
1232    False
1233    False
1234     True
1235    False
1236    False
1237    False
1238    False
1239    False
1240    False
1241    False
1242    False
1243    False
1244    False
1245    False
1246    False
1247    False
1248    False
1249    False
1250    False
1251    False
1252    False
1253     True
1254     True
1255     True
1256     True
1257     True
1258     True
1259     True
Name: female, dtype: bool

In [11]:
#2. Вставим это условие в другое выражение
df[df['female'] == 1].head()
# мы создали субдатафрейм, в котором информация только о женщинах

   wage  exper  union  goodhlth  black  female  married  service  educ  looks
0  5.73     30      0         1      0       1        1        1    14      4
1  4.28     28      0         1      0       1        1        0    12      3
2  7.96     35      0         1      0       1        0        0    10      4
5  3.91     20      0         0      0       1        1        0    12      3
8  5.00      5      0         1      0       1        0        0    16      3

In [12]:
# 3. Из нашего субдатафрейма вытаскиваем столбец с зарплатами и считаем среднее
df[df['female']==1]['wage'].mean()

4.299357798165136

In [13]:
# А теперь посчитаем отношение средних зарплат мужчин и женщин
female_wage_avr = df[df['female']==1]['wage'].mean()
male_wage_avr = df[df['female']==0]['wage'].mean()
sex_wage_ratio = round((female_wage_avr / male_wage_avr)*100, 1)
print("Средняя женская зарплата составляет {} % средней мужской зарплаты".format(sex_wage_ratio))

Средняя женская зарплата составляет 58.3 % средней мужской зарплаты

#### Сравним средние зарплаты женатых и неженатых мужчин, а также замужних и незамужних женщин

In [14]:
female__married_wage_avr = df[(df['female']==1) & (df['married'] == 1)]['wage'].mean()
female__single_wage_avr = df[(df['female']==1) & (df['married'] == 0)]['wage'].mean()
female_wage_ratio = round((female__married_wage_avr  / female__single_wage_avr)*100, 3)
print("Зарплата замужних женщин: ", female__married_wage_avr)
print("Зарплата одиноких женщин: ", female__single_wage_avr)
print("Зарплата замужних женщин в среднем составляет {} % от зарплаты одиноких женщин".format(female_wage_ratio))

Зарплата замужних женщин:  4.299859154929576
Зарплата одиноких женщин:  4.298878923766819
Зарплата замужних женщин в среднем составляет 100.023 % от зарплаты одиноких женщин

In [15]:
male__married_wage_avr = df[(df['female']==0) & (df['married'] == 1)]['wage'].mean()
male__single_wage_avr = df[(df['female']==0) & (df['married'] == 0)]['wage'].mean()
male_wage_ratio = round((male__married_wage_avr  / male__single_wage_avr)*100, 2)
print("Зарплата женатых мужчин: ", round(male__married_wage_avr,2))
print("Зарплата одиноких мужчин: ", round(male__single_wage_avr, 2))
print("Зарплата женатых мужчин в среднем составляет {} % от зарплаты одиноких мужчин".format(male_wage_ratio))

Зарплата женатых мужчин:  7.72
Зарплата одиноких мужчин:  5.99
Зарплата женатых мужчин в среднем составляет 128.84 % от зарплаты одиноких мужчин

### Метод groupby

groupby берет наш датафрейм и итерирует по признаку, который мы укажем.

groupby позволяет итерировать по разным значениям признака, который мы будем называть категориальным.

Категориальный признак - это признак, у которого множество значений СЧЕТНО, т.е. не бексонечность.

У нашего признака 'looks' - пять категориальных значений и вот по ним мы будем итерироваться.

In [16]:
# создадим объект, похожий на итератор
df.groupby(['looks'])

In [17]:
# пройдемся циклом по этому итератору и напечатаем тип объекта
for i in df.groupby('looks'):
    print(type(i))

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

In [19]:
for i in df.groupby(['looks']):
    print(type(i))

<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>
<class 'tuple'>

In [25]:
# пробежимся по значениям нашего итератора
for look, sub_df in df.groupby(['looks']):
    print(look)

1
2
3
4
5

In [35]:
# а вот так получается итерация, когда каждому значению из нашего столбца-итератора соответствует субДатаФрейм
for look, sub_df in df.groupby('looks'):
    print('_'*50)
    print(look)
    print(sub_df.head())

__________________________________________________
1
      wage  exper  union  goodhlth  black  female  married  service  educ  \
28    8.35     41      0         0      0       0        1        1    16
200   3.75     36      0         1      0       0        0        0    12
248  10.99     40      0         1      0       0        1        0    12
327   1.65     24      0         1      0       1        0        1    13
751   7.93     39      1         1      0       0        1        0    12

     looks
28       1
200      1
248      1
327      1
751      1
__________________________________________________
2
    wage  exper  union  goodhlth  black  female  married  service  educ  looks
12  5.14     19      0         1      0       0        1        1    17      2
33  8.17     18      0         1      0       0        1        0    16      2
35  9.62     37      0         1      0       0        1        0    13      2
37  7.69     10      1         1      0       0        1        0    13      2
57  6.56     17      0         1      0       0        1        0    13      2
__________________________________________________
3
    wage  exper  union  goodhlth  black  female  married  service  educ  looks
1   4.28     28      0         1      0       1        1        0    12      3
3  11.57     38      0         1      0       0        1        1    16      3
4  11.42     27      0         1      0       0        1        0    16      3
5   3.91     20      0         0      0       1        1        0    12      3
6   8.76     12      0         1      0       0        1        0    16      3
__________________________________________________
4
    wage  exper  union  goodhlth  black  female  married  service  educ  looks
0   5.73     30      0         1      0       1        1        1    14      4
2   7.96     35      0         1      0       1        0        0    10      4
7   7.69      5      1         1      0       0        0        0    16      4
10  3.45      3      0         1      0       1        0        0    12      4
11  4.03      6      0         1      0       0        1        0    16      4
__________________________________________________
5
      wage  exper  union  goodhlth  black  female  married  service  educ  \
26   14.84     29      0         1      0       0        0        1    13
27   19.08     17      0         1      0       0        0        0    17
76   23.32     15      0         1      0       0        1        1    17
112   6.11      7      0         1      0       1        1        0    12
316   3.92     12      0         1      0       0        1        1    12

     looks
26       5
27       5
76       5
112      5
316      5

В столбце looks - рейтинг привлекательности
Давайте посчитаем, как зарабатывают люди, в зависимости от рейтинга привлекательности

In [40]:
for i, sub_df in df.groupby('looks'):
    print(i)
    print(sub_df['wage'].median())

1
3.46
2
4.595000000000001
3
5.635
4
5.24
5
4.81

In [41]:
# посмотрим как зависит зарплата от рейтинга у женщин
for i, sub_df in df.groupby('looks'):
    print(i)
    print(sub_df[sub_df['female']==1]['wage'].median())

1
2.15
2
3.415
3
3.75
4
3.8049999999999997
5
4.175000000000001

In [42]:
# посмотрим как зависит зарплата от рейтинга у мужчин
for i, sub_df in df.groupby('looks'):
    print(i)
    print(sub_df[sub_df['female']==0]['wage'].median())

1
6.625
2
5.355
3
6.73
4
6.3100000000000005
5
7.96

#### Пример группировки по нескольким значениям - декартово произведение

In [44]:
for i, sub_df in df.groupby(['looks', 'female']):
    print(i)
    print(sub_df['wage'].median())

(1, 0)
6.625
(1, 1)
2.15
(2, 0)
5.355
(2, 1)
3.415
(3, 0)
6.73
(3, 1)
3.75
(4, 0)
6.3100000000000005
(4, 1)
3.8049999999999997
(5, 0)
7.96
(5, 1)
4.175000000000001

### groupby и agg()

С помощью agg() можно более красиво посчитать какие то характеристики каких то признаков, разделенных на группы по значениям категориального признака

Например, мы хотим посчитать средние значения признаков, сгруппированных по рейтингу привлекательности

In [46]:
df.groupby('looks')[['wage', 'exper', 'educ']].agg(np.mean)

           wage      exper       educ
looks
1      4.621538  27.000000  10.000000
2      5.328803  18.922535  12.105634
3      6.504598  19.491690  12.421053
4      6.299341  15.406593  13.074176
5      7.388421  11.631579  13.368421

In [47]:
df.groupby('looks')[['wage', 'exper', 'educ']].agg(np.median)

        wage  exper  educ
looks
1      3.460   32.0  12.0
2      4.595   18.0  12.0
3      5.635   18.0  12.0
4      5.240   12.5  13.0
5      4.810    8.0  12.0

### Вывод взаимосвязи двух признаков - методом crosstab

с помощью метода crosstab строим сводную таблицу

In [49]:
pd.crosstab(df['female'], df['married'])

married    0    1
female
0        166  658
1        223  213

In [54]:
# нормализации по всем ячейкам
pd.crosstab(df['female'], df['married'], normalize=True)

married         0         1
female
0        0.131746  0.522222
1        0.176984  0.169048

In [55]:
# нормализации по строкам
pd.crosstab(df['female'], df['married'], normalize='index')

married         0         1
female
0        0.201456  0.798544
1        0.511468  0.488532

In [57]:
# нормализации по столбцам
pd.crosstab(df['female'], df['married'], normalize='columns')

married         0         1
female
0        0.426735  0.755454
1        0.573265  0.244546

In [58]:
# нормализации по строкам
pd.crosstab(df['looks'], df['married'], normalize='index')

married         0         1
looks
1        0.384615  0.615385
2        0.288732  0.711268
3        0.283934  0.716066
4        0.348901  0.651099
5        0.578947  0.421053

In [59]:
# нормализации по строкам
pd.crosstab(df['looks'], df[df['female']==1]['married'], normalize='index')

married       0.0       1.0
looks
1        0.800000  0.200000
2        0.388889  0.611111
3        0.497854  0.502146
4        0.551471  0.448529
5        0.875000  0.125000

In [60]:
# нормализации по строкам
pd.crosstab(df['looks'], df[df['female']==0]['married'], normalize='index')

married       0.0       1.0
looks
1        0.125000  0.875000
2        0.227273  0.772727
3        0.182004  0.817996
4        0.228070  0.771930
5        0.363636  0.636364

In [61]:
# нормализации по строкам
pd.crosstab(df[df['female']==0]['married'], df['looks'], normalize='index')

looks           1         2         3         4         5
married
0.0      0.006024  0.120482  0.536145  0.313253  0.024096
1.0      0.010638  0.103343  0.607903  0.267477  0.010638

In [62]:
# нормализации по строкам
pd.crosstab(df[df['female']==1]['married'], df['looks'], normalize='index')

looks           1        2         3         4         5
married
0.0      0.017937  0.09417  0.520179  0.336323  0.031390
1.0      0.004695  0.15493  0.549296  0.286385  0.004695

### Добавляем новые признаки  - комибинации существующих признаков

Добавим новый признак, который делит людей по уровню доходов.
Пусть порог 75% квинтиль
Т.е. 3/4 людей имеют доходы меньше порогового

In [63]:
df['wage'].describe()

count    1260.000000
mean        6.306690
std         4.660639
min         1.020000
25%         3.707500
50%         5.300000
75%         7.695000
max        77.720000
Name: wage, dtype: float64

In [64]:
df['is_rich'] = df['wage']>df['wage'].quantile(.75)

In [65]:
df['is_rich'].head()

0    False
1    False
2     True
3     True
4     True
Name: is_rich, dtype: bool

#### с помощью метода astype мы можем превратить булевые значения столбца 'is_rich' в нули и единицы

In [67]:
df['is_rich'] = df['is_rich'].astype('int64')
df['is_rich'].head()

0    0
1    0
2    1
3    1
4    1
Name: is_rich, dtype: int64

###  Применение функции к каждому столбцу